ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/main.c
#define SCHED_MAX_EVENT_DATA_SIZE       APP_TIMER_SCHED_EVENT_DATA_SIZE     // Maximum size of scheduler events.  
#ifdef SVCALL_AS_NORMAL_FUNCTION 
#define SCHED_QUEUE_SIZE                20                                  // Maximum number of events in the scheduler queue. More is needed in case of Serialization.  
#else 
#define SCHED_QUEUE_SIZE                10                                  // Maximum number of events in the scheduler queue.  
#endif 

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

//*********************GLOBALS*******************//

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

uint8_t nus_data_global[244]; //max MTU matches chucksize of react.js app 
uint8_t parser_trace = 0; 
uint8_t string_length; 
uint32_t data_length; 


//***********************************************//

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


char* fetch_name(uint16_t length, uint8_t offset)
{
    char* name = malloc(sizeof(char[16])); //max size of name string

    switch(length)
    {
        case '1': 
            *(name) = nus_data_global[offset]; 
            string_length = 1; 
            parser_trace += 1; 
            break; 
        case '2': 
            for(int i = 0; i < 2; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 2; 
            parser_trace += 2;
            break; 
        case '3': 
            for(int i = 0; i < 3; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 3; 
            parser_trace += 3;
            break; 
        case '4': 
            for(int i = 0; i < 4; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 4;
            parser_trace += 4;
            break; 
        case '5': 
            for(int i = 0; i < 5; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 5;
            parser_trace += 5;
            break; 
        case '6': 
            for(int i = 0; i < 6; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 6;
            parser_trace += 6;
            break; 
        case '7': 
            for(int i = 0; i < 7; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 7;
            parser_trace += 7;
            break; 
        case '8': 
            for(int i = 0; i < 8; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 8;
            parser_trace += 8;
            break; 
        case '9': 
            for(int i = 0; i < 9; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 9;
            parser_trace += 9;
            break; 
        case 0x3130: //10 in binary coded decimal
            for(int i = 0; i < 10; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 10;
            parser_trace += 10;
            break; 
        case 0x3131: //11
             for(int i = 0; i < 11; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 11;
            parser_trace += 11;
            break; 
        case 0x3132: //12
            for(int i = 0; i < 12; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 12;
            parser_trace += 12;
            break; 
        case 0x3133: //13
             for(int i = 0; i < 13; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 13;
            parser_trace += 13;
            break; 
        case 0x3134: //14
             for(int i = 0; i < 14; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 14;
            parser_trace += 14;
            break; 
        case 0x3135: //15
            for(int i = 0; i < 15; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 15;
            parser_trace += 15;
            break; 
        case 0x3136: //16
            for(int i = 0; i < 16; i++) 
            {
                *(name + i) = nus_data_global[offset + i];
            }
            string_length = 16;
            parser_trace += 16;
            break; 

        default:
              //TODO throw error, max length is 16 
            break; 

