ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/main.c
    }

    return name; 

}

char* ble_parse_name(uint8_t offset) //pass in all offsets
{
    char string_len[2];
    char *name;

    char num_chars = nus_data_global[offset]; 
    parser_trace += 1;
    if(num_chars == '1')//length is described by one char 
    {
        string_len[0] = nus_data_global[offset + 1];
        uint16_t name_len = string_len[0];
        parser_trace += 1;
        name = fetch_name(name_len, offset + 2); //offset is 6 
    }
    else if(num_chars == '2') //length is described by two chars 
    {
        string_len[0] = nus_data_global[offset + 1];
        string_len[1] = nus_data_global[offset + 2];
        uint16_t name_len = string_len[0] << 8 | string_len[1]; 
        parser_trace += 2; 
        name = fetch_name(name_len, offset + 3); //offset is 7 
    }
    return name;
} 

void char_string_to_int(uint8_t digits)
{   
    char num_string[9];
    uint8_t hex_bcd[9]; 
    uint32_t accumulator = 0; 

    for(int i = 0; i < digits; i++)
    {
        num_string[i] = nus_data_global[parser_trace + i];
        hex_bcd[i] = num_string[i] - 0x30; 
        accumulator += (hex_bcd[i] * pow(10, digits-i-1)); 
    }
    data_length = accumulator; 
}

void ble_parse_data_length(uint8_t offset)
{
    char num_chars = nus_data_global[offset]; 
    parser_trace += 1;
    switch(num_chars)
    {
        case '1':
            char_string_to_int(1);
            parser_trace += 1; 
            break;

        case '2': 
            char_string_to_int(2);
            parser_trace += 2;
            break;

        case '3':
            char_string_to_int(3);
            parser_trace += 3;
            break;

        case '4':
            char_string_to_int(4);
            parser_trace += 4;
            break;

        case '5':
            char_string_to_int(5);
            parser_trace += 5;
            break;

        case '6':
            char_string_to_int(6);
            parser_trace += 6;
            break;

        case '7':
            char_string_to_int(7);
            parser_trace += 7;
            break;

        case '8':
            char_string_to_int(8);
            parser_trace += 8;
            break;
        
        case '9':
            char_string_to_int(9);
            parser_trace += 9;
            break;

        default:
        //TODO throw error 
            break; 
    }
}



void add_project(void)
{   
    char *project_name;
    uint8_t project_name_length;
    project_name = ble_parse_name(parser_trace); 
    //TODO add project to flash
}


void add_chip(void)
{


}


void add_file(void)
{
    char *file_name;
    uint8_t file_name_length; 
    char *chip_name;
    uint8_t chip_name_length;
    char *project_name;
    uint8_t project_name_length;

    file_name = ble_parse_name(parser_trace);
    file_name_length = string_length; 
    chip_name = ble_parse_name(parser_trace);
    chip_name_length = string_length;
    project_name = ble_parse_name(parser_trace);
    project_name_length = string_length;

    ble_parse_data_length(parser_trace);

    //TODO seek to parent chip in flash and append name strings
    //TODO parse data length and save data to flash
 
} 

void ble_cmd_parser(void)
{
    if(nus_data_global[0] == 'C' && nus_data_global[1] == 'C') //start byte == "CC" 
    {
        char cmd[2]; 

        cmd[0] = nus_data_global[2];
        cmd[1] = nus_data_global[3];
        parser_trace = 4; 

        if(cmd[0] == '1' && cmd[1] =='0') //add project 
        {
            add_project();
        }

        else if(cmd[0] == '2' && cmd[1] =='0') //add chip 
        {
            // add chip to parent project in flash
            add_chip(); 
        }

        else if(cmd[0] == '3' && cmd[1] =='0') //add file 
        {
            // add file to parent chip and project in flash
            add_file(); 
        }

        else if(cmd[0] == '4' && cmd[1] =='0') //delete project 
        {

        }

        else if(cmd[0] == '5' && cmd[1] =='0') //delete chip 
        {

        }

        else if(cmd[0] == '6' && cmd[1] =='0') //delete file
        {

        }
        //TODO free names after writing to flash
    }
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */

static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {        
        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            nus_data_global[i] = p_evt->params.rx_data.p_data[i];
        }

        ble_cmd_parser();     
    }
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

