ParkerSD/FlashBlaster/nRF5_SDK_16.0.0_98a08e2/examples/ble_peripheral/ble_app_uart/pca10056/s140/ses/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

//------------------------------------------------------------------------------ 
//  Function Name:  static void scheduler_init(void) 
//  Description:    Function for the Event Scheduler initialization. 
//  Input:          None 
//  Output:         None 
//  Return:         None 
//------------------------------------------------------------------------------ 
 
static void scheduler_init(void) 
{ 
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE); 
} 

void flashblaster_init(void)
{
    // bool erase_bonds;
    // Initialize.
    
    power_clock_init();
    log_init();
    timers_init();
    //uart_init(); // error here, possible resource conflict.
    //buttons_leds_init(&erase_bonds);
    power_management_init();

    ble_stack_init();
    scheduler_init(); 
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    advertising_start();

    //usb_init(); // not needed utill usb data needed, should test before next rev 
    usb_pwr_init();
    button_init();

    spi_init(); //SPI in blocking mode(no handler inited), may cause issues with BLE later
    qspi_init();
    
    oled_init(); 
    system_init();
    list_init();

    draw_initial_screen();

    battery_init();
}


void hibernate(void)
{
    //nrf_delay_ms(500);
    clear_leds();
    nrf_gpio_pin_clear(RST_PIN); // turn off display
    nrf_gpio_pin_clear(FET_PIN);
    nrf_delay_ms(1000); // delay to avoid reboot after turn off
    nrf_gpio_cfg_sense_input(BTN_ENTER, NRF_GPIO_PIN_PULLUP, NRF_GPIO_PIN_SENSE_LOW);
    NRF_POWER->SYSTEMOFF = 1;
}


int main(void)
{   
    gpio_init();
    nrf_power_dcdcen_set(true);
    if(!nrf_gpio_pin_read(BTN_ENTER) && !nrf_gpio_pin_read(BTN_UP)) 
    {
        flashblaster_init();
    }
    else
    {
        hibernate(); 
    }

    //TODO: should be able to render strings based on presence of data in flash, should not be initing entire filesystem in RAM
    // only store one file hierarchy in RAM, render and pop fucntions, set_current_project(), set_current_chip() , set_current_file()
    // file directory section in flash which is read at boot and can keep tracka of all current projects and their dependencies
    
    // SWD bitbang protocol ref: black magic probe github, and silicon labs swd app note
    // either APP-side or Device-side controls
    // BT5 file transfer from phone app, DFU firmware updates 
    // maximize utiliy of display, maximize ergonoics, a developer and production line tool 

    // Enter main loop.

    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
